#ex1
def check_age(age):              # функция принимает возраст
    if age < 18:                 # если возраст меньше 18
        return "Доступ запрещён" # return возвращает строку и ОСТАНАВЛИВАЕТ функцию
    return "Доступ разрешён"     # выполнится, если условие выше ложное

result = check_age(16)           # вызываем функцию и сохраняем результат
print(result)                    # печатаем то, что вернул return

#ex2
def calculate_area(radius):
    area = 3.14 * radius ** 2
    return area
circle_area = calculate_area(5)  # сохраняем результат функции в переменную
print(circle_area)                # печатаем результат

#ex3
def check_grade(grade):                   # функция принимает оценку
    if grade < 50:                        # если меньше 50
        return "Экзамен не сдан ❌"       # возврат результата
    elif grade < 80:                      # если от 50 до 79
        return "Средний результат ⚠️"
    else:                                 # если 80 и выше
        return "Отлично 💪"

print(check_grade(75))                    # сразу печатаем результат

#ex4
def calculate_bmi(weight, height):
    bmi = weight / (height ** 2)          # формула для расчёта ИМТ
    return bmi
bmi_value = calculate_bmi(70, 1.75)       # сохраняем результат функции в переменную
print(bmi_value)                          # печатаем результат
